
#include <stdint.h>
#include "arch_arm_v7.h"

/*===============================================================================================================*/

void	mmu_flush_cache_all(void)
{
	mmu_flush_icache();
	mmu_flush_dcache();
}

void	mmu_flush_tlb_all(void)
{
   	mmu_flush_itlb();
   	mmu_flush_dtlb();
}

/*===============================================================================================================*/

void mmu_map_section(u32 *L1,u32 va,u32 pa,u32 count,u32 attr)
{
    int i;

    L1 += (va>>20);
    pa &= 0xFFF00000;  //一级映射物理地址要1MB对齐
    for(i=0;i<count;i++)
    {
    	L1[i] = (pa+(i<<20))|(attr);
    }

}

/*===============================================================================================================*/
/*
 * 映射段, 使用二级页表
 */
u32 	mmu_map_section_as_page(u32 *L1,u16 L1_idx,u32 *L2_PA)
{
	u32  value;
	u32  addr;
	
	L1_idx	&= 0x0FFF;

	addr	= (u32)L2_PA;
	addr   &= ~(0x0000003FF);     //L2粗表要1KB对齐
	  
    value = (addr) |
            (DOMAIN_NO_CHECK << 5) |
            (1 << 4) |
            (1);   //Section Coarse Page Tbl(L2为粗表,64KB或4KB)

    L1[L1_idx] =value;
    return value;
}

/*===============================================================================================================*/
/*
 * 映射 4K 小页面
 */
void mmu_map_small_page(u32 *L2,u8 L2_idx,u32 mem_pa)
{
	u32 addr;

	L2_idx &=0x00FF;

	addr  =(u32)mem_pa;
	addr &= 0xFFFFF000; //4KB对齐

    L2[L2_idx] = addr | MMU_L2_4KB(TEX0,AP_USER_RW,CB); //SmallPage(4KB)
}

/*===============================================================================================================*/
/*===============================================================================================================*/
/*
static	void mmu_remap_small_page(mtt_tbl_t *L1,mtt_tbl_t *L2,U32 va_start,U32 pa_start)
{
  	u32 sec,page;
  
  	sec	=va_start>>20;	
  	page =(va_start>>12)&0x00000FFF;
  
  	mmu_map_small_page(L2,page,(u32)pa_start);
  	
 	mmu_map_section_as_page(L1,sec,L2);
      
}*/

/*===============================================================================================================*/
/*===============================================================================================================*/
/*===============================================================================================================*/
