/*
 * Boot_Main.c
 *
 *  Created on: 2017年7月11日
 *      Author: liuwei
 */

#include	"Include.h"
/*=========================================================================================*/

void	nand_read(u8 *buf,u32 page_addr,u32 count);

/*=========================================================================================*/
/*
 * boot.bin烧录在nandflash第一扇区(uboot方式),运行地址为0x80300000;
 * boot.bin运行后,丛nandflash 0x80000位置加载2MB代码到0x80000000处运行.
 */
void BootMain(void)
{
	DebugPuts("NandBoot\r\n");
	nand_flash_init();
	nand_read(0x80000000,0x80000/2048,(2*MB)/2048); //从NandFlash 0x80000 位置读取代码并运行.
	HAL_FlushCacheAll();
	HAL_EnterCritical();
	JumpToAddress(0x80000000);
	while(1);
}

/*=========================================================================================*/
/*=========================================================================================*/
